jasongwq/FINGERPRINT_ATTENDANCE/STM32-M0_LIB/SYSTEM/gpio.h
/***************************************************************/
#include "stm32f0xx.h"
/***************************************************************/
#ifndef __GPIO_H
#define __GPIO_H 
/***************************************************************/

void My_GPIO_Init(GPIO_TypeDef* GPIOx,u16 pin,u8 mode);

#define PA0_OUT   My_GPIO_Init(GPIOA,GPIO_Pin_0,1);
#define PA1_OUT   My_GPIO_Init(GPIOA,GPIO_Pin_1,1);
#define PA2_OUT   My_GPIO_Init(GPIOA,GPIO_Pin_2,1);
#define PA3_OUT   My_GPIO_Init(GPIOA,GPIO_Pin_3,1);
#define PA4_OUT   My_GPIO_Init(GPIOA,GPIO_Pin_4,1);
#define PA5_OUT   My_GPIO_Init(GPIOA,GPIO_Pin_5,1);
#define PA6_OUT   My_GPIO_Init(GPIOA,GPIO_Pin_6,1);
#define PA7_OUT   My_GPIO_Init(GPIOA,GPIO_Pin_7,1);
#define PA8_OUT   My_GPIO_Init(GPIOA,GPIO_Pin_8,1);
#define PA9_OUT   My_GPIO_Init(GPIOA,GPIO_Pin_9,1);
#define PA10_OUT  My_GPIO_Init(GPIOA,GPIO_Pin_10,1);
#define PA11_OUT  My_GPIO_Init(GPIOA,GPIO_Pin_11,1);
#define PA12_OUT  My_GPIO_Init(GPIOA,GPIO_Pin_12,1);
#define PA13_OUT  My_GPIO_Init(GPIOA,GPIO_Pin_13,1);
#define PA14_OUT  My_GPIO_Init(GPIOA,GPIO_Pin_14,1);
#define PA15_OUT  My_GPIO_Init(GPIOA,GPIO_Pin_15,1);

#define PB0_OUT   My_GPIO_Init(GPIOB,GPIO_Pin_0,1);
#define PB1_OUT   My_GPIO_Init(GPIOB,GPIO_Pin_1,1);
#define PB2_OUT   My_GPIO_Init(GPIOB,GPIO_Pin_2,1);
#define PB3_OUT   My_GPIO_Init(GPIOB,GPIO_Pin_3,1);
#define PB4_OUT   My_GPIO_Init(GPIOB,GPIO_Pin_4,1);
#define PB5_OUT   My_GPIO_Init(GPIOB,GPIO_Pin_5,1);
#define PB6_OUT   My_GPIO_Init(GPIOB,GPIO_Pin_6,1);
#define PB7_OUT   My_GPIO_Init(GPIOB,GPIO_Pin_7,1);
#define PB8_OUT   My_GPIO_Init(GPIOB,GPIO_Pin_8,1);
#define PB9_OUT   My_GPIO_Init(GPIOB,GPIO_Pin_9,1);
#define PB10_OUT  My_GPIO_Init(GPIOB,GPIO_Pin_10,1);
#define PB11_OUT  My_GPIO_Init(GPIOB,GPIO_Pin_11,1);
#define PB12_OUT  My_GPIO_Init(GPIOB,GPIO_Pin_12,1);
#define PB13_OUT  My_GPIO_Init(GPIOB,GPIO_Pin_13,1);
#define PB14_OUT  My_GPIO_Init(GPIOB,GPIO_Pin_14,1);
#define PB15_OUT  My_GPIO_Init(GPIOB,GPIO_Pin_15,1);

#define PC0_OUT   My_GPIO_Init(GPIOC,GPIO_Pin_0,1);
#define PC1_OUT   My_GPIO_Init(GPIOC,GPIO_Pin_1,1);
#define PC2_OUT   My_GPIO_Init(GPIOC,GPIO_Pin_2,1);
#define PC3_OUT   My_GPIO_Init(GPIOC,GPIO_Pin_3,1);
#define PC4_OUT   My_GPIO_Init(GPIOC,GPIO_Pin_4,1);
#define PC5_OUT   My_GPIO_Init(GPIOC,GPIO_Pin_5,1);
#define PC6_OUT   My_GPIO_Init(GPIOC,GPIO_Pin_6,1);
#define PC7_OUT   My_GPIO_Init(GPIOC,GPIO_Pin_7,1);
#define PC8_OUT   My_GPIO_Init(GPIOC,GPIO_Pin_8,1);
#define PC9_OUT   My_GPIO_Init(GPIOC,GPIO_Pin_9,1);
#define PC10_OUT  My_GPIO_Init(GPIOC,GPIO_Pin_10,1);
#define PC11_OUT  My_GPIO_Init(GPIOC,GPIO_Pin_11,1);
#define PC12_OUT  My_GPIO_Init(GPIOC,GPIO_Pin_12,1);
#define PC13_OUT  My_GPIO_Init(GPIOC,GPIO_Pin_13,1);
#define PC14_OUT  My_GPIO_Init(GPIOC,GPIO_Pin_14,1);
#define PC15_OUT  My_GPIO_Init(GPIOC,GPIO_Pin_15,1);

#define PD0_OUT   My_GPIO_Init(GPIOD,GPIO_Pin_0,1);
#define PD1_OUT   My_GPIO_Init(GPIOD,GPIO_Pin_1,1);
#define PD2_OUT   My_GPIO_Init(GPIOD,GPIO_Pin_2,1);
#define PD3_OUT   My_GPIO_Init(GPIOD,GPIO_Pin_3,1);
#define PD4_OUT   My_GPIO_Init(GPIOD,GPIO_Pin_4,1);
#define PD5_OUT   My_GPIO_Init(GPIOD,GPIO_Pin_5,1);
#define PD6_OUT   My_GPIO_Init(GPIOD,GPIO_Pin_6,1);
#define PD7_OUT   My_GPIO_Init(GPIOD,GPIO_Pin_7,1);
#define PD8_OUT   My_GPIO_Init(GPIOD,GPIO_Pin_8,1);
#define PD9_OUT   My_GPIO_Init(GPIOD,GPIO_Pin_9,1);
#define PD10_OUT  My_GPIO_Init(GPIOD,GPIO_Pin_10,1);
#define PD11_OUT  My_GPIO_Init(GPIOD,GPIO_Pin_11,1);
#define PD12_OUT  My_GPIO_Init(GPIOD,GPIO_Pin_12,1);
#define PD13_OUT  My_GPIO_Init(GPIOD,GPIO_Pin_13,1);
#define PD14_OUT  My_GPIO_Init(GPIOD,GPIO_Pin_14,1);
#define PD15_OUT  My_GPIO_Init(GPIOD,GPIO_Pin_15,1);

#define PE0_OUT   My_GPIO_Init(GPIOE,GPIO_Pin_0,1);
#define PE1_OUT   My_GPIO_Init(GPIOE,GPIO_Pin_1,1);
#define PE2_OUT   My_GPIO_Init(GPIOE,GPIO_Pin_2,1);
#define PE3_OUT   My_GPIO_Init(GPIOE,GPIO_Pin_3,1);
#define PE4_OUT   My_GPIO_Init(GPIOE,GPIO_Pin_4,1);
#define PE5_OUT   My_GPIO_Init(GPIOE,GPIO_Pin_5,1);
#define PE6_OUT   My_GPIO_Init(GPIOE,GPIO_Pin_6,1);
#define PE7_OUT   My_GPIO_Init(GPIOE,GPIO_Pin_7,1);
#define PE8_OUT   My_GPIO_Init(GPIOE,GPIO_Pin_8,1);
#define PE9_OUT   My_GPIO_Init(GPIOE,GPIO_Pin_9,1);
#define PE10_OUT  My_GPIO_Init(GPIOE,GPIO_Pin_10,1);
#define PE11_OUT  My_GPIO_Init(GPIOE,GPIO_Pin_11,1);
#define PE12_OUT  My_GPIO_Init(GPIOE,GPIO_Pin_12,1);
#define PE13_OUT  My_GPIO_Init(GPIOE,GPIO_Pin_13,1);
#define PE14_OUT  My_GPIO_Init(GPIOE,GPIO_Pin_14,1);
#define PE15_OUT  My_GPIO_Init(GPIOE,GPIO_Pin_15,1);

#define PF0_OUT   My_GPIO_Init(GPIOF,GPIO_Pin_0,1);
#define PF1_OUT   My_GPIO_Init(GPIOF,GPIO_Pin_1,1);
#define PF2_OUT   My_GPIO_Init(GPIOF,GPIO_Pin_2,1);
#define PF3_OUT   My_GPIO_Init(GPIOF,GPIO_Pin_3,1);
#define PF4_OUT   My_GPIO_Init(GPIOF,GPIO_Pin_4,1);
#define PF5_OUT   My_GPIO_Init(GPIOF,GPIO_Pin_5,1);
#define PF6_OUT   My_GPIO_Init(GPIOF,GPIO_Pin_6,1);
#define PF7_OUT   My_GPIO_Init(GPIOF,GPIO_Pin_7,1);
#define PF8_OUT   My_GPIO_Init(GPIOF,GPIO_Pin_8,1);
#define PF9_OUT   My_GPIO_Init(GPIOF,GPIO_Pin_9,1);
#define PF10_OUT  My_GPIO_Init(GPIOF,GPIO_Pin_10,1);
#define PF11_OUT  My_GPIO_Init(GPIOF,GPIO_Pin_11,1);
#define PF12_OUT  My_GPIO_Init(GPIOF,GPIO_Pin_12,1);
#define PF13_OUT  My_GPIO_Init(GPIOF,GPIO_Pin_13,1);
#define PF14_OUT  My_GPIO_Init(GPIOF,GPIO_Pin_14,1);
#define PF15_OUT  My_GPIO_Init(GPIOF,GPIO_Pin_15,1);

#define PG0_OUT   My_GPIO_Init(GPIOG,GPIO_Pin_0,1);
#define PG1_OUT   My_GPIO_Init(GPIOG,GPIO_Pin_1,1);
#define PG2_OUT   My_GPIO_Init(GPIOG,GPIO_Pin_2,1);
#define PG3_OUT   My_GPIO_Init(GPIOG,GPIO_Pin_3,1);
#define PG4_OUT   My_GPIO_Init(GPIOG,GPIO_Pin_4,1);
#define PG5_OUT   My_GPIO_Init(GPIOG,GPIO_Pin_5,1);
#define PG6_OUT   My_GPIO_Init(GPIOG,GPIO_Pin_6,1);
#define PG7_OUT   My_GPIO_Init(GPIOG,GPIO_Pin_7,1);
#define PG8_OUT   My_GPIO_Init(GPIOG,GPIO_Pin_8,1);
#define PG9_OUT   My_GPIO_Init(GPIOG,GPIO_Pin_9,1);
#define PG10_OUT  My_GPIO_Init(GPIOG,GPIO_Pin_10,1);
#define PG11_OUT  My_GPIO_Init(GPIOG,GPIO_Pin_11,1);
#define PG12_OUT  My_GPIO_Init(GPIOG,GPIO_Pin_12,1);
#define PG13_OUT  My_GPIO_Init(GPIOG,GPIO_Pin_13,1);
#define PG14_OUT  My_GPIO_Init(GPIOG,GPIO_Pin_14,1);
#define PG15_OUT  My_GPIO_Init(GPIOG,GPIO_Pin_15,1);

#define PA0_In   My_GPIO_Init(GPIOA,GPIO_Pin_0,0);
#define PA1_In   My_GPIO_Init(GPIOA,GPIO_Pin_1,0);
#define PA2_In   My_GPIO_Init(GPIOA,GPIO_Pin_2,0);
#define PA3_In   My_GPIO_Init(GPIOA,GPIO_Pin_3,0);
#define PA4_In   My_GPIO_Init(GPIOA,GPIO_Pin_4,0);
#define PA5_In   My_GPIO_Init(GPIOA,GPIO_Pin_5,0);
#define PA6_In   My_GPIO_Init(GPIOA,GPIO_Pin_6,0);
#define PA7_In   My_GPIO_Init(GPIOA,GPIO_Pin_7,0);
#define PA8_In   My_GPIO_Init(GPIOA,GPIO_Pin_8,0);
#define PA9_In   My_GPIO_Init(GPIOA,GPIO_Pin_9,0);
#define PA10_In  My_GPIO_Init(GPIOA,GPIO_Pin_10,0);
#define PA11_In  My_GPIO_Init(GPIOA,GPIO_Pin_11,0);
#define PA12_In  My_GPIO_Init(GPIOA,GPIO_Pin_12,0);
#define PA13_In  My_GPIO_Init(GPIOA,GPIO_Pin_13,0);
#define PA14_In  My_GPIO_Init(GPIOA,GPIO_Pin_14,0);
#define PA15_In  My_GPIO_Init(GPIOA,GPIO_Pin_15,0);

#define PB0_In   My_GPIO_Init(GPIOB,GPIO_Pin_0,0);
#define PB1_In   My_GPIO_Init(GPIOB,GPIO_Pin_1,0);
#define PB2_In   My_GPIO_Init(GPIOB,GPIO_Pin_2,0);
#define PB3_In   My_GPIO_Init(GPIOB,GPIO_Pin_3,0);
#define PB4_In   My_GPIO_Init(GPIOB,GPIO_Pin_4,0);
#define PB5_In   My_GPIO_Init(GPIOB,GPIO_Pin_5,0);
#define PB6_In   My_GPIO_Init(GPIOB,GPIO_Pin_6,0);
#define PB7_In   My_GPIO_Init(GPIOB,GPIO_Pin_7,0);
#define PB8_In   My_GPIO_Init(GPIOB,GPIO_Pin_8,0);
#define PB9_In   My_GPIO_Init(GPIOB,GPIO_Pin_9,0);
#define PB10_In  My_GPIO_Init(GPIOB,GPIO_Pin_10,0);
#define PB11_In  My_GPIO_Init(GPIOB,GPIO_Pin_11,0);
#define PB12_In  My_GPIO_Init(GPIOB,GPIO_Pin_12,0);
#define PB13_In  My_GPIO_Init(GPIOB,GPIO_Pin_13,0);
#define PB14_In  My_GPIO_Init(GPIOB,GPIO_Pin_14,0);
#define PB15_In  My_GPIO_Init(GPIOB,GPIO_Pin_15,0);

#define PC0_In   My_GPIO_Init(GPIOC,GPIO_Pin_0,0);
#define PC1_In   My_GPIO_Init(GPIOC,GPIO_Pin_1,0);
#define PC2_In   My_GPIO_Init(GPIOC,GPIO_Pin_2,0);
#define PC3_In   My_GPIO_Init(GPIOC,GPIO_Pin_3,0);
#define PC4_In   My_GPIO_Init(GPIOC,GPIO_Pin_4,0);
#define PC5_In   My_GPIO_Init(GPIOC,GPIO_Pin_5,0);
#define PC6_In   My_GPIO_Init(GPIOC,GPIO_Pin_6,0);
#define PC7_In   My_GPIO_Init(GPIOC,GPIO_Pin_7,0);
#define PC8_In   My_GPIO_Init(GPIOC,GPIO_Pin_8,0);
#define PC9_In   My_GPIO_Init(GPIOC,GPIO_Pin_9,0);
#define PC10_In  My_GPIO_Init(GPIOC,GPIO_Pin_10,0);
#define PC11_In  My_GPIO_Init(GPIOC,GPIO_Pin_11,0);
#define PC12_In  My_GPIO_Init(GPIOC,GPIO_Pin_12,0);
#define PC13_In  My_GPIO_Init(GPIOC,GPIO_Pin_13,0);
#define PC14_In  My_GPIO_Init(GPIOC,GPIO_Pin_14,0);
#define PC15_In  My_GPIO_Init(GPIOC,GPIO_Pin_15,0);

#define PD0_In   My_GPIO_Init(GPIOD,GPIO_Pin_0,0);
#define PD1_In   My_GPIO_Init(GPIOD,GPIO_Pin_1,0);
#define PD2_In   My_GPIO_Init(GPIOD,GPIO_Pin_2,0);
#define PD3_In   My_GPIO_Init(GPIOD,GPIO_Pin_3,0);
#define PD4_In   My_GPIO_Init(GPIOD,GPIO_Pin_4,0);
#define PD5_In   My_GPIO_Init(GPIOD,GPIO_Pin_5,0);
#define PD6_In   My_GPIO_Init(GPIOD,GPIO_Pin_6,0);
#define PD7_In   My_GPIO_Init(GPIOD,GPIO_Pin_7,0);
#define PD8_In   My_GPIO_Init(GPIOD,GPIO_Pin_8,0);
#define PD9_In   My_GPIO_Init(GPIOD,GPIO_Pin_9,0);
#define PD10_In  My_GPIO_Init(GPIOD,GPIO_Pin_10,0);
#define PD11_In  My_GPIO_Init(GPIOD,GPIO_Pin_11,0);
#define PD12_In  My_GPIO_Init(GPIOD,GPIO_Pin_12,0);
#define PD13_In  My_GPIO_Init(GPIOD,GPIO_Pin_13,0);
#define PD14_In  My_GPIO_Init(GPIOD,GPIO_Pin_14,0);
#define PD15_In  My_GPIO_Init(GPIOD,GPIO_Pin_15,0);

#define PE0_In   My_GPIO_Init(GPIOE,GPIO_Pin_0,0);
#define PE1_In   My_GPIO_Init(GPIOE,GPIO_Pin_1,0);
#define PE2_In   My_GPIO_Init(GPIOE,GPIO_Pin_2,0);
#define PE3_In   My_GPIO_Init(GPIOE,GPIO_Pin_3,0);
#define PE4_In   My_GPIO_Init(GPIOE,GPIO_Pin_4,0);
#define PE5_In   My_GPIO_Init(GPIOE,GPIO_Pin_5,0);
#define PE6_In   My_GPIO_Init(GPIOE,GPIO_Pin_6,0);
#define PE7_In   My_GPIO_Init(GPIOE,GPIO_Pin_7,0);
#define PE8_In   My_GPIO_Init(GPIOE,GPIO_Pin_8,0);
#define PE9_In   My_GPIO_Init(GPIOE,GPIO_Pin_9,0);
#define PE10_In  My_GPIO_Init(GPIOE,GPIO_Pin_10,0);
#define PE11_In  My_GPIO_Init(GPIOE,GPIO_Pin_11,0);
#define PE12_In  My_GPIO_Init(GPIOE,GPIO_Pin_12,0);
#define PE13_In  My_GPIO_Init(GPIOE,GPIO_Pin_13,0);
#define PE14_In  My_GPIO_Init(GPIOE,GPIO_Pin_14,0);
#define PE15_In  My_GPIO_Init(GPIOE,GPIO_Pin_15,0);

#define PF0_In   My_GPIO_Init(GPIOF,GPIO_Pin_0,0);
#define PF1_In   My_GPIO_Init(GPIOF,GPIO_Pin_1,0);
#define PF2_In   My_GPIO_Init(GPIOF,GPIO_Pin_2,0);
#define PF3_In   My_GPIO_Init(GPIOF,GPIO_Pin_3,0);
#define PF4_In   My_GPIO_Init(GPIOF,GPIO_Pin_4,0);
#define PF5_In   My_GPIO_Init(GPIOF,GPIO_Pin_5,0);
#define PF6_In   My_GPIO_Init(GPIOF,GPIO_Pin_6,0);
#define PF7_In   My_GPIO_Init(GPIOF,GPIO_Pin_7,0);
#define PF8_In   My_GPIO_Init(GPIOF,GPIO_Pin_8,0);
#define PF9_In   My_GPIO_Init(GPIOF,GPIO_Pin_9,0);
#define PF10_In  My_GPIO_Init(GPIOF,GPIO_Pin_10,0);
#define PF11_In  My_GPIO_Init(GPIOF,GPIO_Pin_11,0);
#define PF12_In  My_GPIO_Init(GPIOF,GPIO_Pin_12,0);
#define PF13_In  My_GPIO_Init(GPIOF,GPIO_Pin_13,0);
#define PF14_In  My_GPIO_Init(GPIOF,GPIO_Pin_14,0);
#define PF15_In  My_GPIO_Init(GPIOF,GPIO_Pin_15,0);

#define PG0_In   My_GPIO_Init(GPIOG,GPIO_Pin_0,0);
#define PG1_In   My_GPIO_Init(GPIOG,GPIO_Pin_1,0);
#define PG2_In   My_GPIO_Init(GPIOG,GPIO_Pin_2,0);
#define PG3_In   My_GPIO_Init(GPIOG,GPIO_Pin_3,0);
#define PG4_In   My_GPIO_Init(GPIOG,GPIO_Pin_4,0);
#define PG5_In   My_GPIO_Init(GPIOG,GPIO_Pin_5,0);
#define PG6_In   My_GPIO_Init(GPIOG,GPIO_Pin_6,0);
#define PG7_In   My_GPIO_Init(GPIOG,GPIO_Pin_7,0);
#define PG8_In   My_GPIO_Init(GPIOG,GPIO_Pin_8,0);
#define PG9_In   My_GPIO_Init(GPIOG,GPIO_Pin_9,0);
#define PG10_In  My_GPIO_Init(GPIOG,GPIO_Pin_10,0);
#define PG11_In  My_GPIO_Init(GPIOG,GPIO_Pin_11,0);
#define PG12_In  My_GPIO_Init(GPIOG,GPIO_Pin_12,0);
#define PG13_In  My_GPIO_Init(GPIOG,GPIO_Pin_13,0);
#define PG14_In  My_GPIO_Init(GPIOG,GPIO_Pin_14,0);
#define PG15_In  My_GPIO_Init(GPIOG,GPIO_Pin_15,0);

//快速IO
#define	Set_A0   GPIOA->BSRR=1<<0 ;
#define	Set_A1   GPIOA->BSRR=1<<1 ;
#define	Set_A2   GPIOA->BSRR=1<<2;
#define	Set_A3   GPIOA->BSRR=1<<3;
#define	Set_A4   GPIOA->BSRR=1<<4;
#define	Set_A5   GPIOA->BSRR=1<<5;
#define	Set_A6   GPIOA->BSRR=1<<6;
#define	Set_A7   GPIOA->BSRR=1<<7;
#define	Set_A8   GPIOA->BSRR=1<<8;
#define	Set_A9   GPIOA->BSRR=1<<9 ;
#define	Set_A10  GPIOA->BSRR=1<<10;
#define	Set_A11  GPIOA->BSRR=1<<11;
#define	Set_A12  GPIOA->BSRR=1<<12;
#define	Set_A13  GPIOA->BSRR=1<<13;
#define	Set_A14  GPIOA->BSRR=1<<14;
#define	Set_A15  GPIOA->BSRR=1<<15;
#define	Set_A(n) GPIOA->BSRR=1<<n;
 
