jasongwq/FINGERPRINT_ATTENDANCE/STM32-M0_LIB/SYSTEM/gpio.h
#define	Set_B0   GPIOB->BSRR=1<<0 ;
#define	Set_B1   GPIOB->BSRR=1<<1;
#define	Set_B2   GPIOB->BSRR=1<<2;
#define	Set_B3   GPIOB->BSRR=1<<3;
#define	Set_B4   GPIOB->BSRR=1<<4;
#define	Set_B5   GPIOB->BSRR=1<<5;
#define	Set_B6   GPIOB->BSRR=1<<6;
#define	Set_B7   GPIOB->BSRR=1<<7;
#define	Set_B8   GPIOB->BSRR=1<<8;
#define	Set_B9   GPIOB->BSRR=1<<9 ;
#define	Set_B10  GPIOB->BSRR=1<<10;
#define	Set_B11  GPIOB->BSRR=1<<11;
#define	Set_B12  GPIOB->BSRR=1<<12;
#define	Set_B13  GPIOB->BSRR=1<<13;
#define	Set_B14  GPIOB->BSRR=1<<14;
#define	Set_B15  GPIOB->BSRR=1<<15;
#define	Set_B(n) GPIOB->BSRR=1<<n;

 
#define	Set_C0   GPIOC->BSRR=1<<0 ;
#define	Set_C1   GPIOC->BSRR=1<<1;
#define	Set_C2   GPIOC->BSRR=1<<2;
#define	Set_C3   GPIOC->BSRR=1<<3;
#define	Set_C4   GPIOC->BSRR=1<<4;
#define	Set_C5   GPIOC->BSRR=1<<5;
#define	Set_C6   GPIOC->BSRR=1<<6;
#define	Set_C7   GPIOC->BSRR=1<<7;
#define	Set_C8   GPIOC->BSRR=1<<8;
#define	Set_C9   GPIOC->BSRR=1<<9 ;
#define	Set_C10  GPIOC->BSRR=1<<10;
#define	Set_C11  GPIOC->BSRR=1<<11;
#define	Set_C12  GPIOC->BSRR=1<<12;
#define	Set_C13  GPIOC->BSRR=1<<13;
#define	Set_C14  GPIOC->BSRR=1<<14;
#define	Set_C15  GPIOC->BSRR=1<<15;
#define	Set_C(n) GPIOC->BSRR=1<<n;
 
#define	Set_D0   GPIOD->BSRR=1<<0 ;
#define	Set_D1   GPIOD->BSRR=1<<1;
#define	Set_D2   GPIOD->BSRR=1<<2;
#define	Set_D3   GPIOD->BSRR=1<<3;
#define	Set_D4   GPIOD->BSRR=1<<4;
#define	Set_D5   GPIOD->BSRR=1<<5;
#define	Set_D6   GPIOD->BSRR=1<<6;
#define	Set_D7   GPIOD->BSRR=1<<7;
#define	Set_D8   GPIOD->BSRR=1<<8;
#define	Set_D9   GPIOD->BSRR=1<<9 ;
#define	Set_D10  GPIOD->BSRR=1<<10;
#define	Set_D11  GPIOD->BSRR=1<<11;
#define	Set_D12  GPIOD->BSRR=1<<12;
#define	Set_D13  GPIOD->BSRR=1<<13;
#define	Set_D14  GPIOD->BSRR=1<<14;
#define	Set_D15  GPIOD->BSRR=1<<15;
#define	Set_D(n) GPIOD->BSRR=1<<n;
 
#define	Set_E0   GPIOE->BSRR=1<<0 ;
#define	Set_E1   GPIOE->BSRR=1<<1;
#define	Set_E2   GPIOE->BSRR=1<<2;
#define	Set_E3   GPIOE->BSRR=1<<3;
#define	Set_E4   GPIOE->BSRR=1<<4;
#define	Set_E5   GPIOE->BSRR=1<<5;
#define	Set_E6   GPIOE->BSRR=1<<6;
#define	Set_E7   GPIOE->BSRR=1<<7;
#define	Set_E8   GPIOE->BSRR=1<<8;
#define	Set_E9   GPIOE->BSRR=1<<9 ;
#define	Set_E10  GPIOE->BSRR=1<<10;
#define	Set_E11  GPIOE->BSRR=1<<11;
#define	Set_E12  GPIOE->BSRR=1<<12;
#define	Set_E13  GPIOE->BSRR=1<<13;
#define	Set_E14  GPIOE->BSRR=1<<14;
#define	Set_E15  GPIOE->BSRR=1<<15;
#define	Set_E(n) GPIOE->BSRR=1<<n;

#define	Set_F0   GPIOF->BSRR=1<<0;
#define	Set_F1   GPIOF->BSRR=1<<1;
#define	Set_F2   GPIOF->BSRR=1<<2;
#define	Set_F3   GPIOF->BSRR=1<<3;
#define	Set_F4   GPIOF->BSRR=1<<4;
#define	Set_F5   GPIOF->BSRR=1<<5;
#define	Set_F6   GPIOF->BSRR=1<<6;
#define	Set_F7   GPIOF->BSRR=1<<7;
#define	Set_F8   GPIOF->BSRR=1<<8;
#define	Set_F9   GPIOF->BSRR=1<<9 ;
#define	Set_F10  GPIOF->BSRR=1<<10;
#define	Set_F11  GPIOF->BSRR=1<<11;
#define	Set_F12  GPIOF->BSRR=1<<12;
#define	Set_F13  GPIOF->BSRR=1<<13;
#define	Set_F14  GPIOF->BSRR=1<<14;
#define	Set_F15  GPIOF->BSRR=1<<15;
#define	Set_F(n) GPIOF->BSRR=1<<n;

#define	Set_G0   GPIOG->BSRR=1<<0 ;
#define	Set_G1   GPIOG->BSRR=1<<1;
#define	Set_G2   GPIOG->BSRR=1<<2;
#define	Set_G3   GPIOG->BSRR=1<<3;
#define	Set_G4   GPIOG->BSRR=1<<4;
#define	Set_G5   GPIOG->BSRR=1<<5;
#define	Set_G6   GPIOG->BSRR=1<<6;
#define	Set_G7   GPIOG->BSRR=1<<7;
#define	Set_G8   GPIOG->BSRR=1<<8;
#define	Set_G9   GPIOG->BSRR=1<<9 ;
#define	Set_G10  GPIOG->BSRR=1<<10;
#define	Set_G11  GPIOG->BSRR=1<<11;
#define	Set_G12  GPIOG->BSRR=1<<12;
#define	Set_G13  GPIOG->BSRR=1<<13;
#define	Set_G14  GPIOG->BSRR=1<<14;
#define	Set_G15  GPIOG->BSRR=1<<15;
#define	Set_G(n) GPIOG->BSRR=1<<n;

//#define Set_GPIO()

#define	Clr_A0   GPIOA->BRR=1<<0; 
#define	Clr_A1   GPIOA->BRR=1<<1;
#define	Clr_A2   GPIOA->BRR=1<<2;
#define	Clr_A3   GPIOA->BRR=1<<3;
#define	Clr_A4   GPIOA->BRR=1<<4;
#define	Clr_A5   GPIOA->BRR=1<<5;
#define	Clr_A6   GPIOA->BRR=1<<6;
#define	Clr_A7   GPIOA->BRR=1<<7;
#define	Clr_A8   GPIOA->BRR=1<<8;
#define	Clr_A9   GPIOA->BRR=1<<9 ;
#define	Clr_A10  GPIOA->BRR=1<<10;
#define	Clr_A11  GPIOA->BRR=1<<11;
#define	Clr_A12  GPIOA->BRR=1<<12;
#define	Clr_A13  GPIOA->BRR=1<<13;
#define	Clr_A14  GPIOA->BRR=1<<14;
#define	Clr_A15  GPIOA->BRR=1<<15;
#define	Clr_A(n) GPIOA->BRR=1<<n;
 
#define	Clr_B0   GPIOB->BRR=1<<0 ;
#define	Clr_B1   GPIOB->BRR=1<<1;
#define	Clr_B2   GPIOB->BRR=1<<2;
#define	Clr_B3   GPIOB->BRR=1<<3;
#define	Clr_B4   GPIOB->BRR=1<<4;
#define	Clr_B5   GPIOB->BRR=1<<5;
#define	Clr_B6   GPIOB->BRR=1<<6;
#define	Clr_B7   GPIOB->BRR=1<<7;
#define	Clr_B8   GPIOB->BRR=1<<8;
#define	Clr_B9   GPIOB->BRR=1<<9 ;
#define	Clr_B10  GPIOB->BRR=1<<10;
#define	Clr_B11  GPIOB->BRR=1<<11;
#define	Clr_B12  GPIOB->BRR=1<<12;
#define	Clr_B13  GPIOB->BRR=1<<13;
#define	Clr_B14  GPIOB->BRR=1<<14;
#define	Clr_B15  GPIOB->BRR=1<<15;
#define	Clr_B(n) GPIOB->BRR=1<<n;

 
#define	Clr_C0   GPIOC->BRR=1<<0 ;
#define	Clr_C1   GPIOC->BRR=1<<1;
#define	Clr_C2   GPIOC->BRR=1<<2;
#define	Clr_C3   GPIOC->BRR=1<<3;
#define	Clr_C4   GPIOC->BRR=1<<4;
#define	Clr_C5   GPIOC->BRR=1<<5;
#define	Clr_C6   GPIOC->BRR=1<<6;
#define	Clr_C7   GPIOC->BRR=1<<7;
#define	Clr_C8   GPIOC->BRR=1<<8;
#define	Clr_C9   GPIOC->BRR=1<<9 ;
#define	Clr_C10  GPIOC->BRR=1<<10;
#define	Clr_C11  GPIOC->BRR=1<<11;
#define	Clr_C12  GPIOC->BRR=1<<12;
#define	Clr_C13  GPIOC->BRR=1<<13;
#define	Clr_C14  GPIOC->BRR=1<<14;
#define	Clr_C15  GPIOC->BRR=1<<15;
#define	Clr_C(n) GPIOC->BRR=1<<n;
 
#define	Clr_D0   GPIOD->BRR=1<<0 ;
#define	Clr_D1   GPIOD->BRR=1<<1;
#define	Clr_D2   GPIOD->BRR=1<<2;
#define	Clr_D3   GPIOD->BRR=1<<3;
#define	Clr_D4   GPIOD->BRR=1<<4;
#define	Clr_D5   GPIOD->BRR=1<<5;
#define	Clr_D6   GPIOD->BRR=1<<6;
#define	Clr_D7   GPIOD->BRR=1<<7;
#define	Clr_D8   GPIOD->BRR=1<<8;
#define	Clr_D9   GPIOD->BRR=1<<9 ;
#define	Clr_D10  GPIOD->BRR=1<<10;
#define	Clr_D11  GPIOD->BRR=1<<11;
#define	Clr_D12  GPIOD->BRR=1<<12;
#define	Clr_D13  GPIOD->BRR=1<<13;
#define	Clr_D14  GPIOD->BRR=1<<14;
#define	Clr_D15  GPIOD->BRR=1<<15;
#define	Clr_D(n) GPIOD->BRR=1<<n;
 
#define	Clr_E0   GPIOE->BRR=1<<0 ;
#define	Clr_E1   GPIOE->BRR=1<<1;
#define	Clr_E2   GPIOE->BRR=1<<2;
#define	Clr_E3   GPIOE->BRR=1<<3;
#define	Clr_E4   GPIOE->BRR=1<<4;
#define	Clr_E5   GPIOE->BRR=1<<5;
#define	Clr_E6   GPIOE->BRR=1<<6;
#define	Clr_E7   GPIOE->BRR=1<<7;
#define	Clr_E8   GPIOE->BRR=1<<8;
#define	Clr_E9   GPIOE->BRR=1<<9 ;
#define	Clr_E10  GPIOE->BRR=1<<10;
#define	Clr_E11  GPIOE->BRR=1<<11;
#define	Clr_E12  GPIOE->BRR=1<<12;
#define	Clr_E13  GPIOE->BRR=1<<13;
#define	Clr_E14  GPIOE->BRR=1<<14;
#define	Clr_E15  GPIOE->BRR=1<<15;
#define	Clr_E(n) GPIOE->BRR=1<<n;

