jasongwq/FINGERPRINT_ATTENDANCE/STM32-M0_LIB/SYSTEM/gpio.h
#define	Clr_F0   GPIOF->BRR=1<<0 ;
#define	Clr_F1   GPIOF->BRR=1<<1;
#define	Clr_F2   GPIOF->BRR=1<<2;
#define	Clr_F3   GPIOF->BRR=1<<3;
#define	Clr_F4   GPIOF->BRR=1<<4;
#define	Clr_F5   GPIOF->BRR=1<<5;
#define	Clr_F6   GPIOF->BRR=1<<6;
#define	Clr_F7   GPIOF->BRR=1<<7;
#define	Clr_F8   GPIOF->BRR=1<<8;
#define	Clr_F9   GPIOF->BRR=1<<9 ;
#define	Clr_F10  GPIOF->BRR=1<<10;
#define	Clr_F11  GPIOF->BRR=1<<11;
#define	Clr_F12  GPIOF->BRR=1<<12;
#define	Clr_F13  GPIOF->BRR=1<<13;
#define	Clr_F14  GPIOF->BRR=1<<14;
#define	Clr_F15  GPIOF->BRR=1<<15;
#define	Clr_F(n) GPIOF->BRR=1<<n;

#define	Clr_G0   GPIOG->BRR=1<<0 ;
#define	Clr_G1   GPIOG->BRR=1<<1;
#define	Clr_G2   GPIOG->BRR=1<<2;
#define	Clr_G3   GPIOG->BRR=1<<3;
#define	Clr_G4   GPIOG->BRR=1<<4;
#define	Clr_G5   GPIOG->BRR=1<<5;
#define	Clr_G6   GPIOG->BRR=1<<6;
#define	Clr_G7   GPIOG->BRR=1<<7;
#define	Clr_G8   GPIOG->BRR=1<<8;
#define	Clr_G9   GPIOG->BRR=1<<9 ;
#define	Clr_G10  GPIOG->BRR=1<<10;
#define	Clr_G11  GPIOG->BRR=1<<11;
#define	Clr_G12  GPIOG->BRR=1<<12;
#define	Clr_G13  GPIOG->BRR=1<<13;
#define	Clr_G14  GPIOG->BRR=1<<14;
#define	Clr_G15  GPIOG->BRR=1<<15;
#define	Clr_G(n) GPIOG->BRR=1<<n;

////////////////////////////////////////////
//快速 读IO
#define A0       ((GPIOA->IDR&(1<<0))?1:0)
#define A1       ((GPIOA->IDR&(1<<1))?1:0)
#define A2       ((GPIOA->IDR&(1<<2))?1:0)
#define A3       ((GPIOA->IDR&(1<<3))?1:0)
#define A4       ((GPIOA->IDR&(1<<4))?1:0)
#define A5       ((GPIOA->IDR&(1<<5))?1:0)
#define A6       ((GPIOA->IDR&(1<<6))?1:0)
#define A7       ((GPIOA->IDR&(1<<7))?1:0)
#define A8       ((GPIOA->IDR&(1<<8))?1:0)
#define A9       ((GPIOA->IDR&(1<<9))?1:0)
#define A10      ((GPIOA->IDR&(1<<10))?1:0)
#define A11      ((GPIOA->IDR&(1<<11))?1:0)
#define A12      ((GPIOA->IDR&(1<<12))?1:0)
#define A13      ((GPIOA->IDR&(1<<13))?1:0)
#define A14      ((GPIOA->IDR&(1<<14))?1:0)
#define A15      ((GPIOA->IDR&(1<<15))?1:0)
#define A(n)     ((GPIOA->IDR&(1<<n))?1:0)

#define Get_A0   ((GPIOA->ODR&(1<<0))?1:0)
#define Get_A1   ((GPIOA->ODR&(1<<1))?1:0)
#define Get_A2   ((GPIOA->ODR&(1<<2))?1:0)
#define Get_A3   ((GPIOA->ODR&(1<<3))?1:0)
#define Get_A4   ((GPIOA->ODR&(1<<4))?1:0)
#define Get_A5   ((GPIOA->ODR&(1<<5))?1:0)
#define Get_A6   ((GPIOA->ODR&(1<<6))?1:0)
#define Get_A7   ((GPIOA->ODR&(1<<7))?1:0)
#define Get_A8   ((GPIOA->ODR&(1<<8))?1:0)
#define Get_A9   ((GPIOA->ODR&(1<<9))?1:0)
#define Get_A10  ((GPIOA->ODR&(1<<10))?1:0)
#define Get_A11  ((GPIOA->ODR&(1<<11))?1:0)
#define Get_A12  ((GPIOA->ODR&(1<<12))?1:0)
#define Get_A13  ((GPIOA->ODR&(1<<13))?1:0)
#define Get_A14  ((GPIOA->ODR&(1<<14))?1:0)
#define Get_A15  ((GPIOA->ODR&(1<<15))?1:0)
#define Get_A(n) ((GPIOA->ODR&(1<<n))?1:0)

#define B0       ((GPIOB->IDR&(1<<0))?1:0)
#define B1       ((GPIOB->IDR&(1<<1))?1:0)
#define B2       ((GPIOB->IDR&(1<<2))?1:0)
#define B3       ((GPIOB->IDR&(1<<3))?1:0)
#define B4       ((GPIOB->IDR&(1<<4))?1:0)
#define B5       ((GPIOB->IDR&(1<<5))?1:0)
#define B6       ((GPIOB->IDR&(1<<6))?1:0)
#define B7       ((GPIOB->IDR&(1<<7))?1:0)
#define B8       ((GPIOB->IDR&(1<<8))?1:0)
#define B9       ((GPIOB->IDR&(1<<9))?1:0)
#define B10      ((GPIOB->IDR&(1<<10))?1:0)
#define B11      ((GPIOB->IDR&(1<<11))?1:0)
#define B12      ((GPIOB->IDR&(1<<12))?1:0)
#define B13      ((GPIOB->IDR&(1<<13))?1:0)
#define B14      ((GPIOB->IDR&(1<<14))?1:0)
#define B15      ((GPIOB->IDR&(1<<15))?1:0)
#define B(n)     ((GPIOB->IDR&(1<<n))?1:0)

#define Get_B0   ((GPIOB->ODR&(1<<0))?1:0)
#define Get_B1   ((GPIOB->ODR&(1<<1))?1:0)
#define Get_B2   ((GPIOB->ODR&(1<<2))?1:0)
#define Get_B3   ((GPIOB->ODR&(1<<3))?1:0)
#define Get_B4   ((GPIOB->ODR&(1<<4))?1:0)
#define Get_B5   ((GPIOB->ODR&(1<<5))?1:0)
#define Get_B6   ((GPIOB->ODR&(1<<6))?1:0)
#define Get_B7   ((GPIOB->ODR&(1<<7))?1:0)
#define Get_B8   ((GPIOB->ODR&(1<<8))?1:0)
#define Get_B9   ((GPIOB->ODR&(1<<9))?1:0)
#define Get_B10  ((GPIOB->ODR&(1<<10))?1:0)
#define Get_B11  ((GPIOB->ODR&(1<<11))?1:0)
#define Get_B12  ((GPIOB->ODR&(1<<12))?1:0)
#define Get_B13  ((GPIOB->ODR&(1<<13))?1:0)
#define Get_B14  ((GPIOB->ODR&(1<<14))?1:0)
#define Get_B15  ((GPIOB->ODR&(1<<15))?1:0)
#define Get_B(n) ((GPIOB->ODR&(1<<n))?1:0)

#define C0       ((GPIOC->IDR&(1<<0))?1:0)
#define C1       ((GPIOC->IDR&(1<<1))?1:0)
#define C2       ((GPIOC->IDR&(1<<2))?1:0)
#define C3       ((GPIOC->IDR&(1<<3))?1:0)
#define C4       ((GPIOC->IDR&(1<<4))?1:0)
#define C5       ((GPIOC->IDR&(1<<5))?1:0)
#define C6       ((GPIOC->IDR&(1<<6))?1:0)
#define C7       ((GPIOC->IDR&(1<<7))?1:0)
#define C8       ((GPIOC->IDR&(1<<8))?1:0)
#define C9       ((GPIOC->IDR&(1<<9))?1:0)
#define C10      ((GPIOC->IDR&(1<<10))?1:0)
#define C11      ((GPIOC->IDR&(1<<11))?1:0)
#define C12      ((GPIOC->IDR&(1<<12))?1:0)
#define C13      ((GPIOC->IDR&(1<<13))?1:0)
#define C14      ((GPIOC->IDR&(1<<14))?1:0)
#define C15      ((GPIOC->IDR&(1<<15))?1:0)
#define C(n)     ((GPIOC->IDR&(1<<n))?1:0)

#define D0       ((GPIOD->IDR&(1<<0))?1:0)
#define D1       ((GPIOD->IDR&(1<<1))?1:0)
#define D2       ((GPIOD->IDR&(1<<2))?1:0)
#define D3       ((GPIOD->IDR&(1<<3))?1:0)
#define D4       ((GPIOD->IDR&(1<<4))?1:0)
#define D5       ((GPIOD->IDR&(1<<5))?1:0)
#define D6       ((GPIOD->IDR&(1<<6))?1:0)
#define D7       ((GPIOD->IDR&(1<<7))?1:0)
#define D8       ((GPIOD->IDR&(1<<8))?1:0)
#define D9       ((GPIOD->IDR&(1<<9))?1:0)
#define D10      ((GPIOD->IDR&(1<<10))?1:0)
#define D11      ((GPIOD->IDR&(1<<11))?1:0)
#define D12      ((GPIOD->IDR&(1<<12))?1:0)
#define D13      ((GPIOD->IDR&(1<<13))?1:0)
#define D14      ((GPIOD->IDR&(1<<14))?1:0)
#define D15      ((GPIOD->IDR&(1<<15))?1:0)
#define D(n)     ((GPIOD->IDR&(1<<n))?1:0)

#define E0       ((GPIOE->IDR&(1<<0))?1:0)
#define E1       ((GPIOE->IDR&(1<<1))?1:0)
#define E2       ((GPIOE->IDR&(1<<2))?1:0)
#define E3       ((GPIOE->IDR&(1<<3))?1:0)
#define E4       ((GPIOE->IDR&(1<<4))?1:0)
#define E5       ((GPIOE->IDR&(1<<5))?1:0)
#define E6       ((GPIOE->IDR&(1<<6))?1:0)
#define E7       ((GPIOE->IDR&(1<<7))?1:0)
#define E8       ((GPIOE->IDR&(1<<8))?1:0)
#define E9       ((GPIOE->IDR&(1<<9))?1:0)
#define E10      ((GPIOE->IDR&(1<<10))?1:0)
#define E11      ((GPIOE->IDR&(1<<11))?1:0)
#define E12      ((GPIOE->IDR&(1<<12))?1:0)
#define E13      ((GPIOE->IDR&(1<<13))?1:0)
#define E14      ((GPIOE->IDR&(1<<14))?1:0)
#define E15      ((GPIOE->IDR&(1<<15))?1:0)
#define E(n)     ((GPIOE->IDR&(1<<n))?1:0)

#define F0       ((GPIOF->IDR&(1<<0))?1:0)
#define F1       ((GPIOF->IDR&(1<<1))?1:0)
#define F2       ((GPIOF->IDR&(1<<2))?1:0)
#define F3       ((GPIOF->IDR&(1<<3))?1:0)
#define F4       ((GPIOF->IDR&(1<<4))?1:0)
#define F5       ((GPIOF->IDR&(1<<5))?1:0)
#define F6       ((GPIOF->IDR&(1<<6))?1:0)
#define F7       ((GPIOF->IDR&(1<<7))?1:0)
#define F8       ((GPIOF->IDR&(1<<8))?1:0)
#define F9       ((GPIOF->IDR&(1<<9))?1:0)
#define F10      ((GPIOF->IDR&(1<<10))?1:0)
#define F11      ((GPIOF->IDR&(1<<11))?1:0)
#define F12      ((GPIOF->IDR&(1<<12))?1:0)
#define F13      ((GPIOF->IDR&(1<<13))?1:0)
#define F14      ((GPIOF->IDR&(1<<14))?1:0)
#define F15      ((GPIOF->IDR&(1<<15))?1:0)
#define F(n)     ((GPIOF->IDR&(1<<n))?1:0)

#define Get_F0   ((GPIOF->ODR&(1<<0))?1:0)
#define Get_F1   ((GPIOF->ODR&(1<<1))?1:0)
#define Get_F2   ((GPIOF->ODR&(1<<2))?1:0)
#define Get_F3   ((GPIOF->ODR&(1<<3))?1:0)
#define Get_F4   ((GPIOF->ODR&(1<<4))?1:0)
#define Get_F5   ((GPIOF->ODR&(1<<5))?1:0)
#define Get_F6   ((GPIOF->ODR&(1<<6))?1:0)
#define Get_F7   ((GPIOF->ODR&(1<<7))?1:0)
#define Get_F8   ((GPIOF->ODR&(1<<8))?1:0)
#define Get_F9   ((GPIOF->ODR&(1<<9))?1:0)
#define Get_F10  ((GPIOF->ODR&(1<<10))?1:0)
#define Get_F11  ((GPIOF->ODR&(1<<11))?1:0)
#define Get_F12  ((GPIOF->ODR&(1<<12))?1:0)
#define Get_F13  ((GPIOF->ODR&(1<<13))?1:0)
#define Get_F14  ((GPIOF->ODR&(1<<14))?1:0)
#define Get_F15  ((GPIOF->ODR&(1<<15))?1:0)
#define Get_F(n) ((GPIOF->ODR&(1<<n))?1:0)

#define G0       ((GPIOG->IDR&(1<<0))?1:0)
#define G1       ((GPIOG->IDR&(1<<1))?1:0)
#define G2       ((GPIOG->IDR&(1<<2))?1:0)
#define G3       ((GPIOG->IDR&(1<<3))?1:0)
#define G4       ((GPIOG->IDR&(1<<4))?1:0)
#define G5       ((GPIOG->IDR&(1<<5))?1:0)
#define G6       ((GPIOG->IDR&(1<<6))?1:0)
#define G7       ((GPIOG->IDR&(1<<7))?1:0)
#define G8       ((GPIOG->IDR&(1<<8))?1:0)
#define G9       ((GPIOG->IDR&(1<<9))?1:0)
#define G10      ((GPIOG->IDR&(1<<10))?1:0)
#define G11      ((GPIOG->IDR&(1<<11))?1:0)
#define G12      ((GPIOG->IDR&(1<<12))?1:0)
#define G13      ((GPIOG->IDR&(1<<13))?1:0)
#define G14      ((GPIOG->IDR&(1<<14))?1:0)
#define G15      ((GPIOG->IDR&(1<<15))?1:0)
#define G(n)     ((GPIOG->IDR&(1<<n))?1:0)




#endif
